
&НаСервере
Процедура ВыгрузитьФактНаСервере()
	
	РеквизитФормыВЗначение("Объект").ВыгрузитьФакт();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФакт(Команда)
	
	ВыгрузитьФактНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{{ BI-Digital: Кашкинбаев Т.А. по заявке 170805 от 21.06.2018 11:00
	Обработки.ИНАГРО_ИнтеграцияPrimavera.ПроверитьСтрокуСоединения();
	//}} BI-Digital: Кашкинбаев Т.А. по заявке 170805 от 21.06.2018 11:00
	
	Объект.ОчищатьТаблицыПередВыгрузкой = Истина;
	
КонецПроцедуры
