// Строка соединения 
//
//  DRIVER={SQL Server};SERVER=10.225.64.3;UID=integration;PWD=Qwer1234;DATABASE=integration_dev
//	DRIVER={SQL Server};SERVER=10.20.5.49;UID=integration;PWD=Qwer1234;DATABASE=integration_test
//
//

&НаКлиенте
Процедура ДокументУГПРПриИзменении(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	УстановитьПараметрыСписка();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{{ BI-Digital: Кашкинбаев Т.А. по заявке 170805 от 21.06.2018 11:00
	Обработки.ИНАГРО_ИнтеграцияPrimavera.ПроверитьСтрокуСоединения();
	//}} BI-Digital: Кашкинбаев Т.А. по заявке 170805 от 21.06.2018 11:00
	
	УстановитьПараметрыСписка();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	РеквизитФормыВЗначение("Объект").ВыгрузитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписка()
	
	Если ЗначениеЗаполнено(Объект.ДокументУГПР) Тогда
		Объект.Проект = Объект.ДокументУГПР.Проект;
		Объект.Версия = Объект.ДокументУГПР.Версия;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Регистратор", Объект.ДокументУГПР);
	Список.Параметры.УстановитьЗначениеПараметра("Проект", Объект.Проект);
	Список.Параметры.УстановитьЗначениеПараметра("Версия", Объект.Версия);
	
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсе(Команда)
	ИзменитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсе(Команда)
	ИзменитьФлажки(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ВключитьВыгружать(Команда)
	Флажки = Новый Массив;
	Флажки.Добавить("ВыгружатьWBS");
	Флажки.Добавить("ВыгружатьРаботы");
	Флажки.Добавить("ВыгружатьРесурсы");
	Флажки.Добавить("ВыгружатьПроект");
	Флажки.Добавить("ВыгружатьОперации");
	ИзменитьФлажки(Истина, Флажки);
КонецПроцедуры


&НаКлиенте
Процедура ВключитьФормировать(Команда)
	Флажки = Новый Массив;
	Флажки.Добавить("ФормироватьWBS");
	Флажки.Добавить("ФормироватьРаботы");
	Флажки.Добавить("ФормироватьРесурсы");
	Флажки.Добавить("ФормироватьПроект");
	Флажки.Добавить("ФормироватьОперации");
	ИзменитьФлажки(Истина, Флажки);
КонецПроцедуры


&НаКлиенте
Процедура ВыключитьВыгружать(Команда)
	Флажки = Новый Массив;
	Флажки.Добавить("ВыгружатьWBS");
	Флажки.Добавить("ВыгружатьРаботы");
	Флажки.Добавить("ВыгружатьРесурсы");
	Флажки.Добавить("ВыгружатьПроект");
	Флажки.Добавить("ВыгружатьОперации");
	ИзменитьФлажки(Ложь, Флажки);
КонецПроцедуры


&НаКлиенте
Процедура ВыключитьФормировать(Команда)
	Флажки = Новый Массив;
	Флажки.Добавить("ФормироватьWBS");
	Флажки.Добавить("ФормироватьРаботы");
	Флажки.Добавить("ФормироватьРесурсы");
	Флажки.Добавить("ФормироватьПроект");
	Флажки.Добавить("ФормироватьОперации");
	ИзменитьФлажки(Ложь, Флажки);
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлажки(Флаг, Флажки = Неопределено)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УстановитьВсеФлажки(Флаг, Флажки);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПроектыНаСервере()
	
	РеквизитФормыВЗначение("Объект").ЗагрузитьПроекты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПроекты(Команда)
	ЗагрузитьПроектыНаСервере();
КонецПроцедуры


