
&НаКлиенте
Процедура ВыполнитьРаспределение(Команда)
	
	Если УГПР.Пустая()  Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран УГПР!");
		возврат;
 	КонецЕсли;
	
	ВыполнитьРаспределениеНаСервере();

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка завершена!");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРаспределениеНаСервере()
	
	ДокументПериодыОбъект = УГПР.ПолучитьОбъект();
	
	РасчетНормыпоТЧ(ДокументПериодыОбъект.РесурсыМатериалы, ДокументПериодыОбъект);
	РасчетНормыпоТЧ(ДокументПериодыОбъект.РесурсыТрудовые, ДокументПериодыОбъект);
	РасчетНормыпоТЧ(ДокументПериодыОбъект.РесурсыМашинные, ДокументПериодыОбъект);
	
	Попытка
		
		ДокументПериодыОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи документа УГПР!"+ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция РасчетНормыпоТЧ(Таблица, ДокументПериодыОбъект)
	
	Работы = ДокументПериодыОбъект.Работы;
	
	Для каждого СтрокаРесурс Из Таблица Цикл
     		
		НайденнаяСтрока = Работы.Найти(СтрокаРесурс.КлючСтроки, "КлючСтроки");

 		Если НайденнаяСтрока <> Неопределено и НайденнаяСтрока.Объем <> 0 Тогда
			
			СтрокаРесурс.НормаРасхода = СтрокаРесурс.Количество/НайденнаяСтрока.Объем;
			
		КонецЕсли;
 		
	КонецЦикла;

КонецФункции

