&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{{ BI-Digital: Кашкинбаев Т.А. по заявке 170805 от 21.06.2018 11:00
	Обработки.ИНАГРО_ИнтеграцияPrimavera.ПроверитьСтрокуСоединения();
	//}} BI-Digital: Кашкинбаев Т.А. по заявке 170805 от 21.06.2018 11:00
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Попытка 
		Если ОбработкаОбъект.ИспользуемоеИмяФайла <> "" Тогда
			ИмяФайла = ОбработкаОбъект.ИспользуемоеИмяФайла;
			ЭтоВнешняяОбработка = Истина;
		Иначе
			ЭтоВнешняяОбработка = Ложь;
		КонецЕсли;
	Исключение
		ЭтоВнешняяОбработка = Ложь;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтоВнешняяОбработка Тогда
		АдресХранилища = "";
		Оповещение = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма);
		НачатьПомещениеФайла(Оповещение, АдресХранилища, ИмяФайла, Ложь, УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, АдресХранилища, ВыбранноеИмя, ДопПараметр) Экспорт
	ИмяОбработки = ПодключитьВнешнююОбработку(АдресХранилища);
КонецПроцедуры	

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
	Возврат ВнешниеОбработки.Подключить(АдресХранилища);
КонецФункции	

&НаКлиенте
Процедура ОткрытьФормуЭтойОбработки(Имя)
	Если ЭтоВнешняяОбработка Тогда
		Форма = ПолучитьФорму("ВнешняяОбработка."+ИмяОбработки+".Форма." + Имя,,ЭтаФорма,,);
	Иначе
		Форма = ПолучитьФорму("Обработка.ИНАГРО_ИнтеграцияPrimavera.Форма."+Имя,,ЭтаФорма,,);
	КонецЕсли;
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаКлассификаторов(Команда)
	ОткрытьФормуЭтойОбработки("ФормаВыгрузкиКлассификаторов");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаПроектов(Команда)
	ОткрытьФормуЭтойОбработки("Форма");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаПроектов(Команда)
	ОткрытьФормуЭтойОбработки("ФормаЗагрузкиПроектов");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаФакта(Команда)
	ОткрытьФормуЭтойОбработки("ФормаВыгрузкиФакта");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаФакта(Команда)
	ОткрытьФормуЭтойОбработки("ФормаЗагрузкиФакта");
КонецПроцедуры


