#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	МассивОтборовПоПериоду = новый Массив;
	
	СтруктураТиповая =  Ложь;
	
	Попытка   	
		
		//МассивОтборовПоПериоду.Добавить(КомпоновщикНастроек.Настройки.Структура[0].Колонки[0].Отбор.Элементы); // ЖЦП общий план
		МассивОтборовПоПериоду.Добавить(КомпоновщикНастроек.Настройки.Структура[0].Колонки[1].Отбор.Элементы); // ЖЦП накопительно
		//МассивОтборовПоПериоду.Добавить(КомпоновщикНастроек.Настройки.Структура[0].Колонки[2].Отбор.Элементы); // Год общий план
		МассивОтборовПоПериоду.Добавить(КомпоновщикНастроек.Настройки.Структура[0].Колонки[3].Отбор.Элементы); // Год накопительно
		МассивОтборовПоПериоду.Добавить(КомпоновщикНастроек.Настройки.Структура[0].Колонки[4].Отбор.Элементы); // Период год + месяц		
		МассивОтборовПоПериоду.Добавить(КомпоновщикНастроек.Настройки.Структура[0].Колонки[5].Отбор.Элементы); // Итоги за период
		
 		СтруктураТиповая = Истина;
	Исключение
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		//Сообщить(ОписаниеОшибки())
	КонецПопытки;

	Если СтруктураТиповая Тогда
		
		СтандартныйПериод = ПолучитьПериодИзНастроек();
		
		Для каждого ЭлементыОтбора Из МассивОтборовПоПериоду Цикл
			
			ЭлементОтбора = НайтиЭлементОтбораПоПредставлению(ЭлементыОтбора, "НачалоПериода");
			Если ЭлементОтбора <> Неопределено Тогда
				ОтборП = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				Если ОтборП <> Неопределено Тогда
					ОтборП.Использование = Истина;
					ОтборП.ПравоеЗначение = СтандартныйПериод.ДатаНачала;
				КонецЕсли;
			КонецЕсли;

			ЭлементОтбора = НайтиЭлементОтбораПоПредставлению(ЭлементыОтбора, "КонецПериода");
			Если ЭлементОтбора <> Неопределено Тогда
 				ОтборП = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				Если ОтборП <> Неопределено Тогда
					ОтборП.Использование = Истина;
					ОтборП.ПравоеЗначение = СтандартныйПериод.ДатаОкончания;
				КонецЕсли;
			КонецЕсли;
			
 		КонецЦикла;
 	КонецЕсли;

КонецПроцедуры

Функция НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, ИмяПоля) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если  ЭлементОтбора.ПредставлениеПользовательскойНастройки = ИмяПоля  Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

Функция ПолучитьПериодИзНастроек()  Экспорт 
	
	Перем РезультатФ;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтандартныйПериод");
	
	СтандартныйПериод = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	
	Если СтандартныйПериод <> Неопределено Тогда
		
		РезультатФ = СтандартныйПериод.Значение;
		
	КонецЕсли;

	Возврат РезультатФ;
	
КонецФункции

#КонецЕсли