
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЭлементОтбора = НайтиЭлементОтбораПоПолю(КомпоновщикНастроек.Настройки.Отбор.Элементы, "КлючСтроки");
	
	ОтборКлюч = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
	
	ОтборКлюч.Использование = ЗначениеЗаполнено(ОтборWBS);
	ОтборКлюч.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборКлюч.ПравоеЗначение = ПолучитьМассивКлючейПодчиненных(ОтборКлючСтроки, ПолучитьПроектИзНастроек());
	
КонецПроцедуры

Функция НайтиЭлементОтбораПоПолю(КоллекцияЭлементов, ИмяПоля) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если  ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля)  Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

&НаСервере
Функция ПолучитьМассивКлючейПодчиненных(КлючРодитель, Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИНАГРО_УГПРРаботы.КлючСтроки,
	               |	ИНАГРО_УГПРРаботы.ЭтоРабота,
	               |	ИНАГРО_УГПРРаботы.КлючСвязи
	               |ИЗ
	               |	РегистрСведений.ИНАГРО_УГПРРаботы КАК ИНАГРО_УГПРРаботы
	               |ГДЕ
	               |	ИНАГРО_УГПРРаботы.Проект = &Проект
	               |	И ИНАГРО_УГПРРаботы.КлючСвязи = &КлючРодитель
	               |	И ИНАГРО_УГПРРаботы.Версия.ВидВерсии = ЗНАЧЕНИЕ(Перечисление.ИНАГРО_ВидВерсии.Рабочая)";
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("КлючРодитель", КлючРодитель);
	Рез = Запрос.Выполнить().Выгрузить();
	
	СписокКлючей = Новый СписокЗначений;
	Для Каждого СтрРез из Рез цикл
		Если СтрРез.ЭтоРабота тогда
			СписокКлючей.Добавить(СтрРез.КлючСтроки);
		Иначе
			СписокПодчиненыхКлючей = ПолучитьМассивКлючейПодчиненных(СтрРез.КлючСтроки, Проект);
			Для Каждого КлючСтрокиПодчиненный из СписокПодчиненыхКлючей цикл
				СписокКлючей.Добавить(КлючСтрокиПодчиненный.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат СписокКлючей;
	
КонецФункции

&НаСервере
фУНКЦИЯ ПолучитьПроектИзНастроек()  Экспорт 
	
	Перем РезультатФ;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Проект");
	
	Проект = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	
	Если Проект <> Неопределено Тогда
		
		РезультатФ = Проект.Значение;
		
	КонецЕсли;

	Возврат РезультатФ;
	
КонецФункции

