
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрылНовыйСеансTestClientИлиПодключилУжеСуществующий()","ЯОткрылНовыйСеансTestClientИлиПодключилУжеСуществующий","Дано Я открыл новый сеанс TestClient или подключил уже существующий","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\TestClients\step_definitions\РаботаСTestClient.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗакрылВсеОкнаКлиентскогоПриложения()","ЯЗакрылВсеОкнаКлиентскогоПриложения","И    Я закрыл все окна клиентского приложения","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюОсновнуюФормуСпискаДокумента(Парам01)","ЯОткрываюОсновнуюФормуСпискаДокумента","Дано Я открываю основную форму списка документа ""ИНАГРО_УГПР""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\Формы\ОткрытьФормуЧерезКоманду.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ИзВыпадающегоСпискаЯВыбираюПоСтроке(Парам01,Парам02)","ИзВыпадающегоСпискаЯВыбираюПоСтроке","И из выпадающего списка ""КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение"" я выбираю по строке 'Автотестирование загрузки 27 улицы'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаКнопку(Парам01)","ЯНажимаюНаКнопку","И я нажимаю на кнопку 'Настроить список...'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ОткрылосьОкно(Парам01)","ОткрылосьОкно","Тогда открылось окно 'Настройка списка'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПерехожуКЗакладке(Парам01)","ЯПерехожуКЗакладке","И я перехожу к закладке ""Группировка""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТаблицеЯНажимаюНаКнопкуСИменем(Парам01,Парам02)","ВТаблицеЯНажимаюНаКнопкуСИменем","И в таблице ""КомпоновщикНастроекПользовательскиеНастройкиЭлемент4Группировка"" я нажимаю на кнопку с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент4ГруппировкаУдалить'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТаблицеЯПерехожуКСтроке(Парам01,ТабПарам)","ВТаблицеЯПерехожуКСтроке","И в таблице ""Список"" я перехожу к строке:","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВыбираюПунктКонтекстногоМенюСИменемНаЭлементеФормыСИменем(Парам01,Парам02)","ЯВыбираюПунктКонтекстногоМенюСИменемНаЭлементеФормыСИменем","И я выбираю пункт контекстного меню с именем 'СписокКонтекстноеМенюСкопировать' на элементе формы с именем ""Список""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗапоминаюКоличествоСтрокТаблицыКак(Парам01,Парам02)","ЯЗапоминаюКоличествоСтрокТаблицыКак","И я запоминаю количество строк таблицы ""РаботыДЗ"" как ""КвоСтрокИсходное""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЭлементФормыСИменемПрисутствуетНаФорме(Парам01)","ЭлементФормыСИменемПрисутствуетНаФорме","И элемент формы с именем ""Шаблон"" присутствует на форме","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУстанавливаюФлагСИменем(Парам01)","ЯУстанавливаюФлагСИменем","И я устанавливаю флаг с именем ""Шаблон""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФлагСИменемРавен(Парам01,Парам02)","ФлагСИменемРавен","И флаг с именем ""Шаблон"" равен ""Истина""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаКнопкуСоздатьПоляСИменем(Парам01)","ЯНажимаюНаКнопкуСоздатьПоляСИменем","И я нажимаю на кнопку создать поля с именем ""Проект""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВПолеЯВвожуТекст(Парам01,Парам02)","ВПолеЯВвожуТекст","Тогда в поле 'Наименование' я ввожу текст 'Шаблон сметы 4-1'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ИзВыпадающегоСпискаЯВыбираюТочноеЗначение(Парам01,Парам02)","ИзВыпадающегоСпискаЯВыбираюТочноеЗначение","И из выпадающего списка ""Горизонт оперативного планирования"" я выбираю точное значение 'Месяц'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЖдуЗакрытияОкнаВТечениеСекунд(Парам01,Парам02)","ЯЖдуЗакрытияОкнаВТечениеСекунд","И я жду закрытия окна 'Проект (создание) *' в течение 2 секунд","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НеПоявилосьОкноПредупрежденияСистемы()","НеПоявилосьОкноПредупрежденияСистемы","Тогда не появилось окно предупреждения системы","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УЭлементаЯЖдуЗначенияВТечениеСекунд(Парам01,Парам02,Парам03)","УЭлементаЯЖдуЗначенияВТечениеСекунд","И у элемента ""Проект"" я жду значения 'Шаблон сметы 4-1' в течение 2 секунд","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЭлементФормыСталРавенШаблону(Парам01,Парам02)","ЭлементФормыСталРавенШаблону","Тогда элемент формы ""Версия"" стал равен шаблону ""Шаблон (*)""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"КоличествоСтрокТаблицыРавноПеременной(Парам01,Парам02)","КоличествоСтрокТаблицыРавноПеременной","И количество строк таблицы ""РаботыДЗ"" равно переменной ""КвоСтрокИсходное""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТаблицеЯПерехожуКПервойСтроке(Парам01)","ВТаблицеЯПерехожуКПервойСтроке","И в таблице ""РаботыДЗ"" я перехожу к первой строке","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯАктивизируюПоле(Парам01)","ЯАктивизируюПоле","И я активизирую поле ""WBS""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТаблицеЯНачинаюРедактированиеСтроки(Парам01)","ВТаблицеЯНачинаюРедактированиеСтроки","И в таблице  ""РаботыДЗ"" я начинаю редактирование строки","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНажимаюНаКнопкуОткрытияПоля(Парам01)","ЯНажимаюНаКнопкуОткрытияПоля","И я нажимаю на кнопку открытия поля ""WBS""","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЭлементФормыСталРавен(Парам01,Парам02)","ЭлементФормыСталРавен","И элемент формы ""Проект"" стал равен 'Шаблон сметы 4-1'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗакрываюТекущееОкно()","ЯЗакрываюТекущееОкно","И я закрываю текущее окно","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТаблицеЯНажимаюНаКнопку(Парам01,Парам02)","ВТаблицеЯНажимаюНаКнопку","И в таблице ""РаботыДЗ"" я нажимаю на кнопку 'Развернуть все'","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf
//	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВТаблицеЯПерехожуКПоследнейСтроке(Парам01)","ВТаблицеЯПерехожуКПоследнейСтроке","И в таблице 'РаботыДЗ' я перехожу к последней строке","",""); //уже был в E:\ONEASS\Repo\add\features\libraries\UITestRunner\step_definitions\РаботаСИнтерфейсом.epf

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

//&НаКлиенте
////Дано Я открыл новый сеанс TestClient или подключил уже существующий
////@ЯОткрылНовыйСеансTestClientИлиПодключилУжеСуществующий()
//Процедура ЯОткрылНовыйСеансTestClientИлиПодключилУжеСуществующий() Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И    Я закрыл все окна клиентского приложения
////@ЯЗакрылВсеОкнаКлиентскогоПриложения()
//Процедура ЯЗакрылВсеОкнаКлиентскогоПриложения() Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Дано Я открываю основную форму списка документа "ИНАГРО_УГПР"
////@ЯОткрываюОсновнуюФормуСпискаДокумента(Парам01)
//Процедура ЯОткрываюОсновнуюФормуСпискаДокумента(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И из выпадающего списка "КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение" я выбираю по строке 'Автотестирование загрузки 27 улицы'
////@ИзВыпадающегоСпискаЯВыбираюПоСтроке(Парам01,Парам02)
//Процедура ИзВыпадающегоСпискаЯВыбираюПоСтроке(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я нажимаю на кнопку 'Настроить список...'
////@ЯНажимаюНаКнопку(Парам01)
//Процедура ЯНажимаюНаКнопку(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Тогда открылось окно 'Настройка списка'
////@ОткрылосьОкно(Парам01)
//Процедура ОткрылосьОкно(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я перехожу к закладке "Группировка"
////@ЯПерехожуКЗакладке(Парам01)
//Процедура ЯПерехожуКЗакладке(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И в таблице "КомпоновщикНастроекПользовательскиеНастройкиЭлемент4Группировка" я нажимаю на кнопку с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент4ГруппировкаУдалить'
////@ВТаблицеЯНажимаюНаКнопкуСИменем(Парам01,Парам02)
//Процедура ВТаблицеЯНажимаюНаКнопкуСИменем(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И в таблице "Список" я перехожу к строке:
////@ВТаблицеЯПерехожуКСтроке(Парам01,ТабПарам)
//Процедура ВТаблицеЯПерехожуКСтроке(Парам01,ТабПарам) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я выбираю пункт контекстного меню с именем 'СписокКонтекстноеМенюСкопировать' на элементе формы с именем "Список"
////@ЯВыбираюПунктКонтекстногоМенюСИменемНаЭлементеФормыСИменем(Парам01,Парам02)
//Процедура ЯВыбираюПунктКонтекстногоМенюСИменемНаЭлементеФормыСИменем(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я запоминаю количество строк таблицы "РаботыДЗ" как "КвоСтрокИсходное"
////@ЯЗапоминаюКоличествоСтрокТаблицыКак(Парам01,Парам02)
//Процедура ЯЗапоминаюКоличествоСтрокТаблицыКак(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И элемент формы с именем "Шаблон" присутствует на форме
////@ЭлементФормыСИменемПрисутствуетНаФорме(Парам01)
//Процедура ЭлементФормыСИменемПрисутствуетНаФорме(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я устанавливаю флаг с именем "Шаблон"
////@ЯУстанавливаюФлагСИменем(Парам01)
//Процедура ЯУстанавливаюФлагСИменем(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И флаг с именем "Шаблон" равен "Истина"
////@ФлагСИменемРавен(Парам01,Парам02)
//Процедура ФлагСИменемРавен(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я нажимаю на кнопку создать поля с именем "Проект"
////@ЯНажимаюНаКнопкуСоздатьПоляСИменем(Парам01)
//Процедура ЯНажимаюНаКнопкуСоздатьПоляСИменем(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Тогда в поле 'Наименование' я ввожу текст 'Шаблон сметы 4-1'
////@ВПолеЯВвожуТекст(Парам01,Парам02)
//Процедура ВПолеЯВвожуТекст(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И из выпадающего списка "Горизонт оперативного планирования" я выбираю точное значение 'Месяц'
////@ИзВыпадающегоСпискаЯВыбираюТочноеЗначение(Парам01,Парам02)
//Процедура ИзВыпадающегоСпискаЯВыбираюТочноеЗначение(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я жду закрытия окна 'Проект (создание) *' в течение 2 секунд
////@ЯЖдуЗакрытияОкнаВТечениеСекунд(Парам01,Парам02)
//Процедура ЯЖдуЗакрытияОкнаВТечениеСекунд(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Тогда не появилось окно предупреждения системы
////@НеПоявилосьОкноПредупрежденияСистемы()
//Процедура НеПоявилосьОкноПредупрежденияСистемы() Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И у элемента "Проект" я жду значения 'Шаблон сметы 4-1' в течение 2 секунд
////@УЭлементаЯЖдуЗначенияВТечениеСекунд(Парам01,Парам02,Парам03)
//Процедура УЭлементаЯЖдуЗначенияВТечениеСекунд(Парам01,Парам02,Парам03) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////Тогда элемент формы "Версия" стал равен шаблону "Шаблон (*)"
////@ЭлементФормыСталРавенШаблону(Парам01,Парам02)
//Процедура ЭлементФормыСталРавенШаблону(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И количество строк таблицы "РаботыДЗ" равно переменной "КвоСтрокИсходное"
////@КоличествоСтрокТаблицыРавноПеременной(Парам01,Парам02)
//Процедура КоличествоСтрокТаблицыРавноПеременной(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И в таблице "РаботыДЗ" я перехожу к первой строке
////@ВТаблицеЯПерехожуКПервойСтроке(Парам01)
//Процедура ВТаблицеЯПерехожуКПервойСтроке(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я активизирую поле "WBS"
////@ЯАктивизируюПоле(Парам01)
//Процедура ЯАктивизируюПоле(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И в таблице  "РаботыДЗ" я начинаю редактирование строки
////@ВТаблицеЯНачинаюРедактированиеСтроки(Парам01)
//Процедура ВТаблицеЯНачинаюРедактированиеСтроки(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я нажимаю на кнопку открытия поля "WBS"
////@ЯНажимаюНаКнопкуОткрытияПоля(Парам01)
//Процедура ЯНажимаюНаКнопкуОткрытияПоля(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И элемент формы "Проект" стал равен 'Шаблон сметы 4-1'
////@ЭлементФормыСталРавен(Парам01,Парам02)
//Процедура ЭлементФормыСталРавен(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И я закрываю текущее окно
////@ЯЗакрываюТекущееОкно()
//Процедура ЯЗакрываюТекущееОкно() Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И в таблице "РаботыДЗ" я нажимаю на кнопку 'Развернуть все'
////@ВТаблицеЯНажимаюНаКнопку(Парам01,Парам02)
//Процедура ВТаблицеЯНажимаюНаКнопку(Парам01,Парам02) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//&НаКлиенте
////И в таблице 'РаботыДЗ' я перехожу к последней строке
////@ВТаблицеЯПерехожуКПоследнейСтроке(Парам01)
//Процедура ВТаблицеЯПерехожуКПоследнейСтроке(Парам01) Экспорт
//	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры
