#language: ru

Функционал: <описание фичи>

Как Разрабоотчик
Я хочу Я хочу проверить работу обработки загрузки
Чтобы уменьшить количество ошибок

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий


Сценарий: Я хочу проверить работу обработки загрузки


	И Я Проверяю работу обработки загрузки формата551	
	И Я Проверяю работу обработки загрузки формата5521
	И Я Проверяю работу обработки загрузки формата553
	И Я Проверяю работу обработки загрузки формата5531
	И Я Проверяю работу обработки загрузки формата556	
	И Я Проверяю работу обработки загрузки формата2018
	И Я Проверяю работу обработки загрузки формата555
	И Я Проверяю работу обработки загрузки формата552
	И Я Проверяю работу обработки загрузки формата556_97
	И Я Проверяю работу обработки загрузки Формата555_Безресурсов
	И Я Проверяю работу обработки загрузки формата2018_Коэф
	И Я закрыл все окна клиентского приложения
	

