
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	УправлениеЭлементами();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОрганизации(Команда)
 	ОткрытьФорму("Справочник.Организации.ФормаСписка", , ЭтаФорма);
 КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОперации(Команда)
	ОткрытьФорму("Справочник.ИНАГРО_Операции.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроекты(Команда)
	ОткрытьФорму("Справочник.Проекты.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти

