
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	ЗначениеПараметра = ПараметрПользовательскойНастройки.Значение;
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("СтандартныйПериод") Тогда
		
		Если НачалоГода(ЗначениеПараметра.ДатаНачала) <> НачалоГода(ЗначениеПараметра.ДатаОкончания) Тогда
		    Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата начала и дата окончания должны быть в периоде одного года!!!";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
