  
&НаКлиенте
Процедура ОтборWBSНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
 	НовыйЭлементОтбора.Использование = Ложь;

	СтандартнаяОбработка = Ложь;
	
	Проект = ПолучитьПроектИзНастроек(Отчет.КомпоновщикНастроек);

	ДопПараметры = новый Структура;
  	ДопПараметры.Вставить("Проект", Проект);
	ДопПараметры.Вставить("ВерсияИсточника", Неопределено);
 	ДопПараметры.Вставить("Версия", УстановитьВерсию(Проект));
 	ДопПараметры.Вставить("ТолькоWBS", Истина);
 	
 	JJ = Новый ОписаниеОповещения("ВыборРаботыЗавершениеРедактирование", ЭтаФорма);
	
	ОткрытьФорму("Документ.ИНАГРО_УГПР.Форма.ФормаВыбораЭлементаWBS", ДопПараметры ,,,,, JJ);

КонецПроцедуры

&НаСервереБезКонтекста
фУНКЦИЯ ПолучитьПроектИзНастроек(КомпоновщикНастроек)
	
	Перем РезультатФ;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Проект");
	
	Проект = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	
	Если Проект <> Неопределено Тогда
		
		РезультатФ = Проект.Значение;
		
	КонецЕсли;

	Возврат РезультатФ;
	
КонецФункции

&НаСервереБезКонтекста
Функция  УстановитьВерсию(Проект)
	Возврат Справочники.ИНАГРО_Версия.РабочаяВерсияПроекта(Проект);
КонецФункции

 &НаКлиенте
Процедура ВыборРаботыЗавершениеРедактирование(Результат, ДопПараметры)  Экспорт
	
 	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
 	
	Для каждого СтрокаРезультата Из Результат  Цикл
		
		Отчет.ОтборWBS = СтрокаРезультата.ВидРаботыСоответствия;
		Отчет.ОтборКлючСтроки = СтрокаРезультата.КлючСтрокиСоответствия;
   		
 	КонецЦикла;

КонецПроцедуры
