
Функция ОбъединятьЯчейки(ТабДок, индСтр, индКол)
    Ячейка = ТабДок.Область(индСтр, индКол);
    ЯчейкаСлед = ТабДок.Область(индСтр, индКол+1);
	Если ПустаяСтрока(Ячейка.Текст) Тогда
        Возврат ложь
    ИначеЕсли
        Ячейка.Текст = ЯчейкаСлед.Текст
            И Ячейка.Верх = Ячейка.Низ И ЯчейкаСлед.Верх = ЯчейкаСлед.Низ Тогда
        Возврат Истина;
    Иначе
        Возврат ложь
    КонецЕсли;
КонецФункции

Функция НовыйШрифтЯчейки(Шрифт)
	НовыйШрифтЯчейки = Новый Шрифт(Шрифт,,,Ложь);
	Возврат НовыйШрифтЯчейки;
КонецФункции

Функция ОбработатьЗаголовки(ТабДок)
	СчетчикВыводаОценки = 0;
	СписокИдентификации = Новый СписокЗначений;
	СписокИдентификации.Добавить("Риски");

	ВысотаФ = ТабДок.ФиксацияСверху;
    ШиринаФ = ТабДок.ФиксацияСлева;
    ОбъединяемаяОбласть = Неопределено;
    Для индСтр = -ВысотаФ По -1 Цикл
        Если ТабДок.Область(-индСтр,1).Текст = "" Тогда
            Возврат ТабДок;
        КонецЕсли;
        НачальнаяКолонка = 0;
        Для индКол=ШиринаФ+1 По ТабДок.ШиринаТаблицы Цикл
			//****Цвета
			  ТекстЗаголовка = СокрЛП(ТабДок.Область(-индСтр, индКол).Текст);

			Если СписокИдентификации.НайтиПоЗначению(ТекстЗаголовка) <> Неопределено Тогда
				Ячейка = ТабДок.Область(-индСтр, индКол);
				Ячейка.ЦветФона = WebЦвета.СинийСПороховымОттенком;
				Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				Ячейка.Шрифт = НовыйШрифтЯчейки(Ячейка.Шрифт);
			КонецЕсли;

			///****
			
			Если ОбъединятьЯчейки(ТабДок, -индСтр, индКол) Тогда
			    Если не НачальнаяКолонка Тогда
			        НачальнаяКолонка = индКол;
			    КонецЕсли;
			ИначеЕсли НачальнаяКолонка Тогда
			    ТекстЗаголовка = ТабДок.Область(-индСтр, индКол).Текст;
								
				ОбъединяемаяОбласть = ТабДок.Область(-индСтр, НачальнаяКолонка, -индСтр, индКол);
			    ОбъединяемаяОбласть.Объединить();
			    ОбъединяемаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			    ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
			    НачальнаяКолонка = 0;
			Иначе
			    НачальнаяКолонка = 0;
			КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    Возврат ТабДок;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	   СтандартнаяОбработка = Ложь;
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки, Истина);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ДокументРезультат.ФиксацияСлева = 0;
    ДокументРезультат = ОбработатьЗаголовки(ДокументРезультат);

КонецПроцедуры
