
&НаСервереБезКонтекста
Процедура СМ_ПозицияЛокальнойСметыНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_ПозицияЛокальнойСметы.Ссылка
		|ИЗ
		|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();  ТекОбъект.Удалить();	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура СМ_ПозицияЛокальнойСметы(Команда)
	СМ_ПозицияЛокальнойСметыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СМ_АктВыполненныхРаботНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_АктВыполненныхРабот.Ссылка
		|ИЗ
		|	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл ТекОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();  ТекОбъект.Удалить();	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура СМ_АктВыполненныхРабот(Команда)
	СМ_АктВыполненныхРаботНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СМ_СтоимостьРесурсовПозицииНаСервере()
 	Набор =	РегистрыСведений.СМ_СтоимостьРесурсовПозиции.СоздатьНаборЗаписей();
	Набор.Записать(Истина);
КонецПроцедуры
