#language: ru

@Tree
@exportscenarios
@Ignore

Функционал: Под сценарий заполнения ограничений
 
Сценарий:  Я проверяю наименования в таблице "Парам1" колонка "Парам2"
  
	Тогда таблица "Парам1" стала равной:
		| "Парам2"                                                                                                                     |
		| 'Планировка площадей Легкий бульдозерами мощностью от 37 до 96 кВт грунта вида Крупнообломочные грунты дальностью до 500 метров'          |
		| 'Планировка площадей Легкий бульдозерами мощностью от 37 до 96 кВт грунта вида Песчаные грунты дальностью до 500 метров'                  |
		| 'Планировка площадей Легкий бульдозерами мощностью от 37 до 96 кВт грунта вида Суглинки и супесь дальностью до 500 метров'                |
		| 'Планировка площадей Легкий бульдозерами мощностью от 37 до 96 кВт грунта вида Глинистые грунты дальностью до 500 метров'                 |
		| 'Планировка площадей Легкий бульдозерами мощностью от 37 до 96 кВт грунта вида Лессы и лессовидные грунты дальностью до 500 метров'       |
		| 'Планировка площадей Легкий бульдозерами мощностью от 37 до 96 кВт грунта вида Торф дальностью до 500 метров'                             |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Скальные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Крупнообломочные грунты дальностью свыше 500 метров'    |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Песчаные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Суглинки и супесь дальностью свыше 500 метров'          |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Глинистые грунты дальностью свыше 500 метров'           |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Лессы и лессовидные грунты дальностью свыше 500 метров' |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 103 до 219 кВт грунта вида Торф дальностью свыше 500 метров'                       |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Скальные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Крупнообломочные грунты дальностью свыше 500 метров'    |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Песчаные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Суглинки и супесь дальностью свыше 500 метров'          |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Глинистые грунты дальностью свыше 500 метров'           |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Лессы и лессовидные грунты дальностью свыше 500 метров' |
		| 'Планировка площадей Тяжелый бульдозерами мощностью от 220 до 405 кВт грунта вида Торф дальностью свыше 500 метров'                       |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Скальные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Крупнообломочные грунты дальностью свыше 500 метров'    |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Песчаные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Суглинки и супесь дальностью свыше 500 метров'          |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Глинистые грунты дальностью свыше 500 метров'           |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Лессы и лессовидные грунты дальностью свыше 500 метров' |
		| 'Планировка площадей Средний бульдозерами мощностью от 103 до 219 кВт грунта вида Торф дальностью свыше 500 метров'                       |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Скальные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Крупнообломочные грунты дальностью свыше 500 метров'    |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Песчаные грунты дальностью свыше 500 метров'            |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Суглинки и супесь дальностью свыше 500 метров'          |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Глинистые грунты дальностью свыше 500 метров'           |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Лессы и лессовидные грунты дальностью свыше 500 метров' |
		| 'Планировка площадей Средний бульдозерами мощностью от 220 до 405 кВт грунта вида Торф дальностью свыше 500 метров'                       |

