#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтруктураТиповая =  Ложь;
	Попытка   		
		ЭлементыОтбораПоПериоду = КомпоновщикНастроек.Настройки.Структура[0].Колонки[2].Отбор.Элементы;
		ЭлементыОтбораПоПериодуИтоги = КомпоновщикНастроек.Настройки.Структура[0].Колонки[3].Отбор.Элементы;
		СтруктураТиповая = Истина;
	Исключение
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		//Сообщить(ОписаниеОшибки())
	КонецПопытки;

	Если СтруктураТиповая Тогда
		
		СтандартныйПериод = ПолучитьПериодИзНастроек();
		
		ЭлементОтбора = НайтиЭлементОтбораПоПредставлению(ЭлементыОтбораПоПериоду, "НачалоПериода");
		ОтборП = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		Если ОтборП <> Неопределено Тогда
			ОтборП.Использование = Истина;
			ОтборП.ПравоеЗначение = СтандартныйПериод.ДатаНачала;
		КонецЕсли;

		ЭлементОтбора = НайтиЭлементОтбораПоПредставлению(ЭлементыОтбораПоПериоду, "КонецПериода");
		ОтборП = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		Если ОтборП <> Неопределено Тогда
			ОтборП.Использование = Истина;
			ОтборП.ПравоеЗначение = СтандартныйПериод.ДатаОкончания;
		КонецЕсли;
		
		ЭлементОтбора = НайтиЭлементОтбораПоПредставлению(ЭлементыОтбораПоПериодуИтоги, "НачалоПериода");
		ОтборП = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		Если ОтборП <> Неопределено Тогда
			ОтборП.Использование = Истина;
			ОтборП.ПравоеЗначение = СтандартныйПериод.ДатаНачала;
		КонецЕсли;

		ЭлементОтбора = НайтиЭлементОтбораПоПредставлению(ЭлементыОтбораПоПериодуИтоги, "КонецПериода");
		ОтборП = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		Если ОтборП <> Неопределено Тогда
			ОтборП.Использование = Истина;
			ОтборП.ПравоеЗначение = СтандартныйПериод.ДатаОкончания;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Функция НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, ИмяПоля) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		Если  ЭлементОтбора.ПредставлениеПользовательскойНастройки = ИмяПоля  Тогда
			ВозвращаемоеЗначение = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение
	
КонецФункции

Функция ПолучитьПериодИзНастроек()  Экспорт 
	
	Перем РезультатФ;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтандартныйПериод");
	
	СтандартныйПериод = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	
	Если СтандартныйПериод <> Неопределено Тогда
		
		РезультатФ = СтандартныйПериод.Значение;
		
	КонецЕсли;

	Возврат РезультатФ;
	
КонецФункции

#КонецЕсли