
&НаКлиенте
Процедура ВыполнитьПеренос(Команда)
	
	Если ЗначениеЗаполнено(Проект) и ЗначениеЗаполнено(ВерсияИсточник) и ЗначениеЗаполнено(ВерсияПриемник) Тогда

		Если ВерсияИсточник <> ВерсияПриемник Тогда
			ВыполнитьПереносНаСервере();
		иначе
			ПоказатьПредупреждение(,"Версии должны быть разные", 60);
		КонецЕсли;
		
	Иначе
		
		ПоказатьПредупреждение(,"Заполните параметры", 60);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьПереносНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ВерсияИсточник = "";
	ВерсияПриемник = "";
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВерсияИсточникПриИзмененииНаСервере(ВерсияИсточник, НетЗаписейИсточника)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИНАГРО_СоответствияWBS.Версия
		|ИЗ
		|	РегистрСведений.ИНАГРО_СоответствияWBS КАК ИНАГРО_СоответствияWBS
		|ГДЕ
		|	ИНАГРО_СоответствияWBS.Версия = &Версия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИНАГРО_СоответствияWBS.Версия
		|ИЗ
		|	РегистрСведений.ИНАГРО_СоответствияWBS КАК ИНАГРО_СоответствияWBS
		|ГДЕ
		|	ИНАГРО_СоответствияWBS.ВерсияСоответствия = &Версия";
	
	Запрос.УстановитьПараметр("Версия", ВерсияИсточник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НетЗаписейИсточника =  РезультатЗапроса.Пустой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияИсточникПриИзменении(Элемент)
	
	НетЗаписейИсточника = Истина;
	ВерсияИсточникПриИзмененииНаСервере( ВерсияИсточник, НетЗаписейИсточника);
	
	Если НетЗаписейИсточника Тогда
		ПоказатьПредупреждение(, "Для указанной версии не обнаружены соответствия, проверьте выбранную версию через обработку Мастер сопоставления или отчет Соответствия версий проекта", 60);
	КонецЕсли;
	
КонецПроцедуры
